print("*******Hello********")
print("Добро пожаловать! Выберете непонятное слово из списка")
print("ЛОЛ , КРИНЖ , РОФЛ , ЩИЩ , КРИПОВЫЙ , АГРИТЬСЯ")
meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "РОФЛ": "Шутка",
            "ЩИЩ": "одобрение или восторг",
            "КРИПОВЫЙ": "страшный, пугающий",
            "АГРИТЬСЯ": "Злиться",
            }
while True:
    word = input("Введите непонятное слово").upper()
    print(word)
    if word in meme_dict.keys():
        print(meme_dict[word])
    else:
        print("Такого слова в словаре нет")
